fduignan/stm32l031_examples/ST7789/STM32L0x3.h
/*
 * Copyright (c) 2009-2016 ARM Limited. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     STM32L0x3.h
 * @brief    CMSIS HeaderFile
 * @version  1.3
 * @date     15. December 2017
 * @note     Generated by SVDConv V3.2.66 on Friday, 15.12.2017 22:16:35
 *           from File 'STM32L0x3.svd',
 *           last modified on Tuesday, 26.09.2017 08:52:54
 */



/** @addtogroup 
  * @{
  */


/** @addtogroup STM32L0x3
  * @{
  */


#ifndef STM32L0X3_H
#define STM32L0X3_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M0+ Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* =========================================  STM32L0x3 Specific Interrupt Numbers  ========================================== */
  WWDG_IRQn                 =   0,              /*!< 0  Window Watchdog interrupt                                              */
  PVD_IRQn                  =   1,              /*!< 1  PVD through EXTI line detection                                        */
  RTC_IRQn                  =   2,              /*!< 2  RTC global interrupt                                                   */
  RCC_IRQn                  =   4,              /*!< 4  RCC global interrupt                                                   */
  EXTI0_1_IRQn              =   5,              /*!< 5  EXTI Line[1:0] interrupts                                              */
  EXTI2_3_IRQn              =   6,              /*!< 6  EXTI Line[3:2] interrupts                                              */
  EXTI4_15_IRQn             =   7,              /*!< 7  EXTI Line15 and EXTI4 interrupts                                       */
  TSC_IRQn                  =   8,              /*!< 8  Touch sensing interrupt                                                */
  DMA1_Channel1_IRQn        =   9,              /*!< 9  DMA1 Channel1 global interrupt                                         */
  DMA1_Channel2_3_IRQn      =  10,              /*!< 10 DMA1 Channel2 and 3 interrupts                                         */
  DMA1_Channel4_7_IRQn      =  11,              /*!< 11 DMA1 Channel4 to 7 interrupts                                          */
  ADC_COMP_IRQn             =  12,              /*!< 12 ADC and comparator 1 and 2                                             */
  LPTIM1_IRQn               =  13,              /*!< 13 LPTIMER1 interrupt through EXTI29                                      */
  USART4_USART5_IRQn        =  14,              /*!< 14 USART4/USART5 global interrupt                                         */
  TIM2_IRQn                 =  15,              /*!< 15 TIM2 global interrupt                                                  */
  TIM3_IRQn                 =  16,              /*!< 16 TIM3 global interrupt                                                  */
  TIM6_DAC_IRQn             =  17,              /*!< 17 TIM6 global interrupt and DAC                                          */
  TIM7_IRQn                 =  18,              /*!< 18 TIM7 global interrupt and DAC                                          */
  TIM21_IRQn                =  20,              /*!< 20 TIMER21 global interrupt                                               */
  I2C3_IRQn                 =  21,              /*!< 21 I2C3 global interrupt                                                  */
  TIM22_IRQn                =  22,              /*!< 22 TIMER22 global interrupt                                               */
  I2C1_IRQn                 =  23,              /*!< 23 I2C1 global interrupt                                                  */
  I2C2_IRQn                 =  24,              /*!< 24 I2C2 global interrupt                                                  */
  SPI1_IRQn                 =  25,              /*!< 25 SPI1_global_interrupt                                                  */
  SPI2_IRQn                 =  26,              /*!< 26 SPI2 global interrupt                                                  */
  USART1_IRQn               =  27,              /*!< 27 USART1 global interrupt                                                */
  USART2_IRQn               =  28,              /*!< 28 USART2 global interrupt                                                */
  AES_RNG_LPUART1_IRQn      =  29,              /*!< 29 AES global interrupt RNG global interrupt and LPUART1 global
                                                     interrupt through                                                         */
  LCD_IRQn                  =  30,              /*!< 30 LCD global interrupt                                                   */
  USB_IRQn                  =  31               /*!< 31 USB event interrupt through EXTI18                                     */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

