fduignan/stm32l031_examples/ST7789/STM32L0x3.h
/* ==========================  Configuration of the ARM Cortex-M0+ Processor and Core Peripherals  =========================== */
//#define __CM0+_REV                 0x0000U      /*!< CM0+ Core Revision                                                        */
#define __NVIC_PRIO_BITS               3        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 0        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0+.h"                          /*!< ARM Cortex-M0+ processor and core peripherals                             */
#include "system_STM32L0x3.h"                   /*!< STM32L0x3 System                                                          */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            AES                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced encryption standard hardware  accelerator (AES)
  */

typedef struct {                                /*!< (@ 0x40026000) AES Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) control register                                           */
  __IM  uint32_t  SR;                           /*!< (@ 0x00000004) status register                                            */
  __IOM uint32_t  DINR;                         /*!< (@ 0x00000008) data input register                                        */
  __IM  uint32_t  DOUTR;                        /*!< (@ 0x0000000C) data output register                                       */
  __IOM uint32_t  KEYR0;                        /*!< (@ 0x00000010) key register 0                                             */
  __IOM uint32_t  KEYR1;                        /*!< (@ 0x00000014) key register 1                                             */
  __IOM uint32_t  KEYR2;                        /*!< (@ 0x00000018) key register 2                                             */
  __IOM uint32_t  KEYR3;                        /*!< (@ 0x0000001C) key register 3                                             */
  __IOM uint32_t  IVR0;                         /*!< (@ 0x00000020) initialization vector register 0                           */
  __IOM uint32_t  IVR1;                         /*!< (@ 0x00000024) initialization vector register 1                           */
  __IOM uint32_t  IVR2;                         /*!< (@ 0x00000028) initialization vector register 2                           */
  __IOM uint32_t  IVR3;                         /*!< (@ 0x0000002C) initialization vector register 3                           */
} AES_Type;                                     /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital-to-analog converter (DAC)
  */

typedef struct {                                /*!< (@ 0x40007400) DAC Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) control register                                           */
  __OM  uint32_t  SWTRIGR;                      /*!< (@ 0x00000004) software trigger register                                  */
  __IOM uint32_t  DHR12R1;                      /*!< (@ 0x00000008) channel1 12-bit right-aligned data holding register        */
  __IOM uint32_t  DHR12L1;                      /*!< (@ 0x0000000C) channel1 12-bit left-aligned data holding register         */
  __IOM uint32_t  DHR8R1;                       /*!< (@ 0x00000010) channel1 8-bit right-aligned data holding register         */
  __IOM uint32_t  DHR12R2;                      /*!< (@ 0x00000014) channel2 12-bit right-aligned data holding register        */
  __IOM uint32_t  DHR12L2;                      /*!< (@ 0x00000018) channel2 12-bit left-aligned data holding register         */
  __IOM uint32_t  DHR8R2;                       /*!< (@ 0x0000001C) channel2 8-bit right-aligned data holding register         */
  __IOM uint32_t  DHR12RD;                      /*!< (@ 0x00000020) Dual DAC 12-bit right-aligned data holding register        */
  __IOM uint32_t  DHR12LD;                      /*!< (@ 0x00000024) Dual DAC 12-bit left-aligned data holding register         */
  __IOM uint32_t  DHR8RD;                       /*!< (@ 0x00000028) Dual DAC 8-bit right-aligned data holding register         */
  __IM  uint32_t  DOR1;                         /*!< (@ 0x0000002C) channel1 data output register                              */
  __IM  uint32_t  DOR2;                         /*!< (@ 0x00000030) channel2 data output register                              */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000034) status register                                            */
} DAC_Type;                                     /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                           DMA1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Direct memory access controller (DMA1)
  */

typedef struct {                                /*!< (@ 0x40020000) DMA1 Structure                                             */
  __IM  uint32_t  ISR;                          /*!< (@ 0x00000000) interrupt status register                                  */
  __OM  uint32_t  IFCR;                         /*!< (@ 0x00000004) interrupt flag clear register                              */
  __IOM uint32_t  CCR1;                         /*!< (@ 0x00000008) channel x configuration register                           */
  __IOM uint32_t  CNDTR1;                       /*!< (@ 0x0000000C) channel x number of data register                          */
  __IOM uint32_t  CPAR1;                        /*!< (@ 0x00000010) channel x peripheral address register                      */
  __IOM uint32_t  CMAR1;                        /*!< (@ 0x00000014) channel x memory address register                          */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CCR2;                         /*!< (@ 0x0000001C) channel x configuration register                           */
  __IOM uint32_t  CNDTR2;                       /*!< (@ 0x00000020) channel x number of data register                          */
  __IOM uint32_t  CPAR2;                        /*!< (@ 0x00000024) channel x peripheral address register                      */
  __IOM uint32_t  CMAR2;                        /*!< (@ 0x00000028) channel x memory address register                          */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  CCR3;                         /*!< (@ 0x00000030) channel x configuration register                           */
  __IOM uint32_t  CNDTR3;                       /*!< (@ 0x00000034) channel x number of data register                          */
  __IOM uint32_t  CPAR3;                        /*!< (@ 0x00000038) channel x peripheral address register                      */
  __IOM uint32_t  CMAR3;                        /*!< (@ 0x0000003C) channel x memory address register                          */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  CCR4;                         /*!< (@ 0x00000044) channel x configuration register                           */
  __IOM uint32_t  CNDTR4;                       /*!< (@ 0x00000048) channel x number of data register                          */
  __IOM uint32_t  CPAR4;                        /*!< (@ 0x0000004C) channel x peripheral address register                      */
  __IOM uint32_t  CMAR4;                        /*!< (@ 0x00000050) channel x memory address register                          */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  CCR5;                         /*!< (@ 0x00000058) channel x configuration register                           */
  __IOM uint32_t  CNDTR5;                       /*!< (@ 0x0000005C) channel x number of data register                          */
  __IOM uint32_t  CPAR5;                        /*!< (@ 0x00000060) channel x peripheral address register                      */
  __IOM uint32_t  CMAR5;                        /*!< (@ 0x00000064) channel x memory address register                          */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  CCR6;                         /*!< (@ 0x0000006C) channel x configuration register                           */
  __IOM uint32_t  CNDTR6;                       /*!< (@ 0x00000070) channel x number of data register                          */
  __IOM uint32_t  CPAR6;                        /*!< (@ 0x00000074) channel x peripheral address register                      */
  __IOM uint32_t  CMAR6;                        /*!< (@ 0x00000078) channel x memory address register                          */
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  CCR7;                         /*!< (@ 0x00000080) channel x configuration register                           */
  __IOM uint32_t  CNDTR7;                       /*!< (@ 0x00000084) channel x number of data register                          */
  __IOM uint32_t  CPAR7;                        /*!< (@ 0x00000088) channel x peripheral address register                      */
  __IOM uint32_t  CMAR7;                        /*!< (@ 0x0000008C) channel x memory address register                          */
  __IM  uint32_t  RESERVED6[6];
  __IOM uint32_t  CSELR;                        /*!< (@ 0x000000A8) channel selection register                                 */
} DMA1_Type;                                    /*!< Size = 172 (0xac)                                                         */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cyclic redundancy check calculation  unit (CRC)
  */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */
  __IOM uint32_t  DR;                           /*!< (@ 0x00000000) Data register                                              */
  __IOM uint32_t  IDR;                          /*!< (@ 0x00000004) Independent data register                                  */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000008) Control register                                           */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  INIT;                         /*!< (@ 0x00000010) Initial CRC value                                          */
  __IOM uint32_t  POL;                          /*!< (@ 0x00000014) polynomial                                                 */
} CRC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOA)
  */

typedef struct {                                /*!< (@ 0x50000000) GPIOA Structure                                            */
  __IOM uint32_t  MODER;                        /*!< (@ 0x00000000) GPIO port mode register                                    */
  __IOM uint32_t  OTYPER;                       /*!< (@ 0x00000004) GPIO port output type register                             */
  __IOM uint32_t  OSPEEDR;                      /*!< (@ 0x00000008) GPIO port output speed register                            */
  __IOM uint32_t  PUPDR;                        /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
  __IM  uint32_t  IDR;                          /*!< (@ 0x00000010) GPIO port input data register                              */
  __IOM uint32_t  ODR;                          /*!< (@ 0x00000014) GPIO port output data register                             */
  __OM  uint32_t  BSRR;                         /*!< (@ 0x00000018) GPIO port bit set/reset register                           */
  __IOM uint32_t  LCKR;                         /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
  __IOM uint32_t  AFRL;                         /*!< (@ 0x00000020) GPIO alternate function low register                       */
  __IOM uint32_t  AFRH;                         /*!< (@ 0x00000024) GPIO alternate function high register                      */
  __OM  uint32_t  BRR;                          /*!< (@ 0x00000028) GPIO port bit reset register                               */
} GPIOA_Type;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOB                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOB)
  */

typedef struct {                                /*!< (@ 0x50000400) GPIOB Structure                                            */
  __IOM uint32_t  MODER;                        /*!< (@ 0x00000000) GPIO port mode register                                    */
  __IOM uint32_t  OTYPER;                       /*!< (@ 0x00000004) GPIO port output type register                             */
  __IOM uint32_t  OSPEEDR;                      /*!< (@ 0x00000008) GPIO port output speed register                            */
  __IOM uint32_t  PUPDR;                        /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
  __IM  uint32_t  IDR;                          /*!< (@ 0x00000010) GPIO port input data register                              */
  __IOM uint32_t  ODR;                          /*!< (@ 0x00000014) GPIO port output data register                             */
  __OM  uint32_t  BSRR;                         /*!< (@ 0x00000018) GPIO port bit set/reset register                           */
  __IOM uint32_t  LCKR;                         /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
  __IOM uint32_t  AFRL;                         /*!< (@ 0x00000020) GPIO alternate function low register                       */
  __IOM uint32_t  AFRH;                         /*!< (@ 0x00000024) GPIO alternate function high register                      */
  __OM  uint32_t  BRR;                          /*!< (@ 0x00000028) GPIO port bit reset register                               */
} GPIOB_Type;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           LPTIM                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Low power timer (LPTIM)
  */

