fduignan/stm32l031_examples/ST7789/STM32L0x3.h
typedef struct {                                /*!< (@ 0x40007C00) LPTIM Structure                                            */
  __IM  uint32_t  ISR;                          /*!< (@ 0x00000000) Interrupt and Status Register                              */
  __OM  uint32_t  ICR;                          /*!< (@ 0x00000004) Interrupt Clear Register                                   */
  __IOM uint32_t  IER;                          /*!< (@ 0x00000008) Interrupt Enable Register                                  */
  __IOM uint32_t  CFGR;                         /*!< (@ 0x0000000C) Configuration Register                                     */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000010) Control Register                                           */
  __IOM uint32_t  CMP;                          /*!< (@ 0x00000014) Compare Register                                           */
  __IOM uint32_t  ARR;                          /*!< (@ 0x00000018) Autoreload Register                                        */
  __IM  uint32_t  CNT;                          /*!< (@ 0x0000001C) Counter Register                                           */
} LPTIM_Type;                                   /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Random number generator (RNG)
  */

typedef struct {                                /*!< (@ 0x40025000) RNG Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) control register                                           */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000004) status register                                            */
  __IM  uint32_t  DR;                           /*!< (@ 0x00000008) data register                                              */
} RNG_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< (@ 0x40002800) RTC Structure                                              */
  __IOM uint32_t  TR;                           /*!< (@ 0x00000000) RTC time register                                          */
  __IOM uint32_t  DR;                           /*!< (@ 0x00000004) RTC date register                                          */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000008) RTC control register                                       */
  __IOM uint32_t  ISR;                          /*!< (@ 0x0000000C) RTC initialization and status register                     */
  __IOM uint32_t  PRER;                         /*!< (@ 0x00000010) RTC prescaler register                                     */
  __IOM uint32_t  WUTR;                         /*!< (@ 0x00000014) RTC wakeup timer register                                  */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  ALRMAR;                       /*!< (@ 0x0000001C) RTC alarm A register                                       */
  __IOM uint32_t  ALRMBR;                       /*!< (@ 0x00000020) RTC alarm B register                                       */
  __OM  uint32_t  WPR;                          /*!< (@ 0x00000024) write protection register                                  */
  __IM  uint32_t  SSR;                          /*!< (@ 0x00000028) RTC sub second register                                    */
  __OM  uint32_t  SHIFTR;                       /*!< (@ 0x0000002C) RTC shift control register                                 */
  __IM  uint32_t  TSTR;                         /*!< (@ 0x00000030) RTC timestamp time register                                */
  __IM  uint32_t  TSDR;                         /*!< (@ 0x00000034) RTC timestamp date register                                */
  __IM  uint32_t  TSSSR;                        /*!< (@ 0x00000038) RTC time-stamp sub second register                         */
  __IOM uint32_t  CALR;                         /*!< (@ 0x0000003C) RTC calibration register                                   */
  __IOM uint32_t  TAMPCR;                       /*!< (@ 0x00000040) RTC tamper configuration register                          */
  __IOM uint32_t  ALRMASSR;                     /*!< (@ 0x00000044) RTC alarm A sub second register                            */
  __IOM uint32_t  ALRMBSSR;                     /*!< (@ 0x00000048) RTC alarm B sub second register                            */
  __IOM uint32_t  OR;                           /*!< (@ 0x0000004C) option register                                            */
  __IOM uint32_t  BKP0R;                        /*!< (@ 0x00000050) RTC backup registers                                       */
  __IOM uint32_t  BKP1R;                        /*!< (@ 0x00000054) RTC backup registers                                       */
  __IOM uint32_t  BKP2R;                        /*!< (@ 0x00000058) RTC backup registers                                       */
  __IOM uint32_t  BKP3R;                        /*!< (@ 0x0000005C) RTC backup registers                                       */
  __IOM uint32_t  BKP4R;                        /*!< (@ 0x00000060) RTC backup registers                                       */
} RTC_Type;                                     /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                          USART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver  transmitter (USART1)
  */

typedef struct {                                /*!< (@ 0x40013800) USART1 Structure                                           */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IOM uint32_t  CR3;                          /*!< (@ 0x00000008) Control register 3                                         */
  __IOM uint32_t  BRR;                          /*!< (@ 0x0000000C) Baud rate register                                         */
  __IOM uint32_t  GTPR;                         /*!< (@ 0x00000010) Guard time and prescaler register                          */
  __IOM uint32_t  RTOR;                         /*!< (@ 0x00000014) Receiver timeout register                                  */
  __OM  uint32_t  RQR;                          /*!< (@ 0x00000018) Request register                                           */
  __IM  uint32_t  ISR;                          /*!< (@ 0x0000001C) Interrupt & status register                                */
  __OM  uint32_t  ICR;                          /*!< (@ 0x00000020) Interrupt flag clear register                              */
  __IM  uint32_t  RDR;                          /*!< (@ 0x00000024) Receive data register                                      */
  __IOM uint32_t  TDR;                          /*!< (@ 0x00000028) Transmit data register                                     */
} USART1_Type;                                  /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                            TSC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Touch sensing controller (TSC)
  */

typedef struct {                                /*!< (@ 0x40024000) TSC Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) control register                                           */
  __IOM uint32_t  IER;                          /*!< (@ 0x00000004) interrupt enable register                                  */
  __IOM uint32_t  ICR;                          /*!< (@ 0x00000008) interrupt clear register                                   */
  __IOM uint32_t  ISR;                          /*!< (@ 0x0000000C) interrupt status register                                  */
  __IOM uint32_t  IOHCR;                        /*!< (@ 0x00000010) I/O hysteresis control register                            */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  IOASCR;                       /*!< (@ 0x00000018) I/O analog switch control register                         */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  IOSCR;                        /*!< (@ 0x00000020) I/O sampling control register                              */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  IOCCR;                        /*!< (@ 0x00000028) I/O channel control register                               */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  IOGCSR;                       /*!< (@ 0x00000030) I/O group control status register                          */
  __IM  uint32_t  IOG1CR;                       /*!< (@ 0x00000034) I/O group x counter register                               */
  __IM  uint32_t  IOG2CR;                       /*!< (@ 0x00000038) I/O group x counter register                               */
  __IM  uint32_t  IOG3CR;                       /*!< (@ 0x0000003C) I/O group x counter register                               */
  __IM  uint32_t  IOG4CR;                       /*!< (@ 0x00000040) I/O group x counter register                               */
  __IM  uint32_t  IOG5CR;                       /*!< (@ 0x00000044) I/O group x counter register                               */
  __IM  uint32_t  IOG6CR;                       /*!< (@ 0x00000048) I/O group x counter register                               */
  __IM  uint32_t  IOG7CR;                       /*!< (@ 0x0000004C) I/O group x counter register                               */
  __IM  uint32_t  IOG8CR;                       /*!< (@ 0x00000050) I/O group x counter register                               */
} TSC_Type;                                     /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                           IWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Independent watchdog (IWDG)
  */

typedef struct {                                /*!< (@ 0x40003000) IWDG Structure                                             */
  __OM  uint32_t  KR;                           /*!< (@ 0x00000000) Key register                                               */
  __IOM uint32_t  PR;                           /*!< (@ 0x00000004) Prescaler register                                         */
  __IOM uint32_t  RLR;                          /*!< (@ 0x00000008) Reload register                                            */
  __IM  uint32_t  SR;                           /*!< (@ 0x0000000C) Status register                                            */
  __IOM uint32_t  WINR;                         /*!< (@ 0x00000010) Window register                                            */
} IWDG_Type;                                    /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           WWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System window watchdog (WWDG)
  */

typedef struct {                                /*!< (@ 0x40002C00) WWDG Structure                                             */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) Control register                                           */
  __IOM uint32_t  CFR;                          /*!< (@ 0x00000004) Configuration register                                     */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000008) Status register                                            */
} WWDG_Type;                                    /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                          USB_FS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal serial bus full-speed device  interface (USB_FS)
  */

typedef struct {                                /*!< (@ 0x40005C00) USB_FS Structure                                           */
  __IOM uint32_t  EP0R;                         /*!< (@ 0x00000000) endpoint register                                          */
  __IOM uint32_t  EP1R;                         /*!< (@ 0x00000004) endpoint register                                          */
  __IOM uint32_t  EP2R;                         /*!< (@ 0x00000008) endpoint register                                          */
  __IOM uint32_t  EP3R;                         /*!< (@ 0x0000000C) endpoint register                                          */
  __IOM uint32_t  EP4R;                         /*!< (@ 0x00000010) endpoint register                                          */
  __IOM uint32_t  EP5R;                         /*!< (@ 0x00000014) endpoint register                                          */
  __IOM uint32_t  EP6R;                         /*!< (@ 0x00000018) endpoint register                                          */
  __IOM uint32_t  EP7R;                         /*!< (@ 0x0000001C) endpoint register                                          */
  __IM  uint32_t  RESERVED[8];
  __IOM uint32_t  CNTR;                         /*!< (@ 0x00000040) control register                                           */
  __IOM uint32_t  ISTR;                         /*!< (@ 0x00000044) interrupt status register                                  */
  __IM  uint32_t  FNR;                          /*!< (@ 0x00000048) frame number register                                      */
  __IOM uint32_t  DADDR;                        /*!< (@ 0x0000004C) device address                                             */
  __IOM uint32_t  BTABLE;                       /*!< (@ 0x00000050) Buffer table address                                       */
  __IOM uint32_t  LPMCSR;                       /*!< (@ 0x00000054) LPM control and status register                            */
  __IOM uint32_t  BCDR;                         /*!< (@ 0x00000058) Battery charging detector                                  */
} USB_FS_Type;                                  /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRS                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock recovery system (CRS)
  */

typedef struct {                                /*!< (@ 0x40006C00) CRS Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) control register                                           */
  __IOM uint32_t  CFGR;                         /*!< (@ 0x00000004) configuration register                                     */
  __IM  uint32_t  ISR;                          /*!< (@ 0x00000008) interrupt and status register                              */
  __IOM uint32_t  ICR;                          /*!< (@ 0x0000000C) interrupt flag clear register                              */
} CRS_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                         Firewall                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Firewall (Firewall)
  */

typedef struct {                                /*!< (@ 0x40011C00) Firewall Structure                                         */
  __IOM uint32_t  FIREWALL_CSSA;                /*!< (@ 0x00000000) Code segment start address                                 */
  __IOM uint32_t  FIREWALL_CSL;                 /*!< (@ 0x00000004) Code segment length                                        */
  __IOM uint32_t  FIREWALL_NVDSSA;              /*!< (@ 0x00000008) Non-volatile data segment start address                    */
  __IOM uint32_t  FIREWALL_NVDSL;               /*!< (@ 0x0000000C) Non-volatile data segment length                           */
  __IOM uint32_t  FIREWALL_VDSSA;               /*!< (@ 0x00000010) Volatile data segment start address                        */
  __IOM uint32_t  FIREWALL_VDSL;                /*!< (@ 0x00000014) Volatile data segment length                               */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  FIREWALL_CR;                  /*!< (@ 0x00000020) Configuration register                                     */
} Firewall_Type;                                /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

