fduignan/stm32l031_examples/ST7789/STM32L0x3.h
typedef struct {                                /*!< (@ 0x40004800) LPUSART1 Structure                                         */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IOM uint32_t  CR3;                          /*!< (@ 0x00000008) Control register 3                                         */
  __IOM uint32_t  BRR;                          /*!< (@ 0x0000000C) Baud rate register                                         */
  __IM  uint32_t  RESERVED[2];
  __OM  uint32_t  RQR;                          /*!< (@ 0x00000018) Request register                                           */
  __IM  uint32_t  ISR;                          /*!< (@ 0x0000001C) Interrupt & status register                                */
  __OM  uint32_t  ICR;                          /*!< (@ 0x00000020) Interrupt flag clear register                              */
  __IM  uint32_t  RDR;                          /*!< (@ 0x00000024) Receive data register                                      */
  __IOM uint32_t  TDR;                          /*!< (@ 0x00000028) Transmit data register                                     */
} LPUSART1_Type;                                /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           NVIC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Nested Vectored Interrupt  Controller (NVIC)
  */

typedef struct {                                /*!< (@ 0xE000E100) NVIC Structure                                             */
  __IOM uint32_t  ISER;                         /*!< (@ 0x00000000) Interrupt Set Enable Register                              */
  __IM  uint32_t  RESERVED[31];
  __IOM uint32_t  ICER;                         /*!< (@ 0x00000080) Interrupt Clear Enable Register                            */
  __IM  uint32_t  RESERVED1[31];
  __IOM uint32_t  ISPR;                         /*!< (@ 0x00000100) Interrupt Set-Pending Register                             */
  __IM  uint32_t  RESERVED2[31];
  __IOM uint32_t  ICPR;                         /*!< (@ 0x00000180) Interrupt Clear-Pending Register                           */
  __IM  uint32_t  RESERVED3[95];
  __IOM uint32_t  IPR0;                         /*!< (@ 0x00000300) Interrupt Priority Register 0                              */
  __IOM uint32_t  IPR1;                         /*!< (@ 0x00000304) Interrupt Priority Register 1                              */
  __IOM uint32_t  IPR2;                         /*!< (@ 0x00000308) Interrupt Priority Register 2                              */
  __IOM uint32_t  IPR3;                         /*!< (@ 0x0000030C) Interrupt Priority Register 3                              */
  __IOM uint32_t  IPR4;                         /*!< (@ 0x00000310) Interrupt Priority Register 4                              */
  __IOM uint32_t  IPR5;                         /*!< (@ 0x00000314) Interrupt Priority Register 5                              */
  __IOM uint32_t  IPR6;                         /*!< (@ 0x00000318) Interrupt Priority Register 6                              */
  __IOM uint32_t  IPR7;                         /*!< (@ 0x0000031C) Interrupt Priority Register 7                              */
} NVIC_Type;                                    /*!< Size = 800 (0x320)                                                        */



/* =========================================================================================================================== */
/* ================                                         USB_SRAM                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal serial bus full-speed device  interface (USB_SRAM)
  */

typedef struct {                                /*!< (@ 0x40006000) USB_SRAM Structure                                         */
  __IOM uint32_t  EP0R;                         /*!< (@ 0x00000000) endpoint 0 register                                        */
  __IOM uint32_t  EP1R;                         /*!< (@ 0x00000004) endpoint 1 register                                        */
  __IOM uint32_t  EP2R;                         /*!< (@ 0x00000008) endpoint 2 register                                        */
  __IOM uint32_t  EP3R;                         /*!< (@ 0x0000000C) endpoint 3 register                                        */
  __IOM uint32_t  EP4R;                         /*!< (@ 0x00000010) endpoint 4 register                                        */
  __IOM uint32_t  EP5R;                         /*!< (@ 0x00000014) endpoint 5 register                                        */
  __IOM uint32_t  EP6R;                         /*!< (@ 0x00000018) endpoint 6 register                                        */
  __IOM uint32_t  EP7R;                         /*!< (@ 0x0000001C) endpoint 7 register                                        */
  __IM  uint32_t  RESERVED[8];
  __IOM uint32_t  CNTR;                         /*!< (@ 0x00000040) control register                                           */
  __IOM uint32_t  ISTR;                         /*!< (@ 0x00000044) interrupt status register                                  */
  __IM  uint32_t  FNR;                          /*!< (@ 0x00000048) frame number register                                      */
  __IOM uint32_t  DADDR;                        /*!< (@ 0x0000004C) device address                                             */
  __IOM uint32_t  BTABLE;                       /*!< (@ 0x00000050) Buffer table address                                       */
  __IOM uint32_t  LPMCSR;                       /*!< (@ 0x00000054) LPM control and status register                            */
  __IOM uint32_t  BCDR;                         /*!< (@ 0x00000058) Battery charging detector                                  */
} USB_SRAM_Type;                                /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                            LCD                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Liquid crystal display controller (LCD)
  */

typedef struct {                                /*!< (@ 0x40002400) LCD Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) control register                                           */
  __IOM uint32_t  FCR;                          /*!< (@ 0x00000004) frame control register                                     */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000008) status register                                            */
  __OM  uint32_t  CLR;                          /*!< (@ 0x0000000C) clear register                                             */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  RAM_COM0;                     /*!< (@ 0x00000014) display memory                                             */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  RAM_COM1;                     /*!< (@ 0x0000001C) display memory                                             */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  RAM_COM2;                     /*!< (@ 0x00000024) display memory                                             */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  RAM_COM3;                     /*!< (@ 0x0000002C) display memory                                             */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  RAM_COM4;                     /*!< (@ 0x00000034) display memory                                             */
  __IM  uint32_t  RESERVED5;
  __IOM uint32_t  RAM_COM5;                     /*!< (@ 0x0000003C) display memory                                             */
  __IM  uint32_t  RESERVED6;
  __IOM uint32_t  RAM_COM6;                     /*!< (@ 0x00000044) display memory                                             */
  __IM  uint32_t  RESERVED7;
  __IOM uint32_t  RAM_COM7;                     /*!< (@ 0x0000004C) display memory                                             */
} LCD_Type;                                     /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                            MPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Memory protection unit (MPU)
  */

typedef struct {                                /*!< (@ 0xE000ED90) MPU Structure                                              */
  __IM  uint32_t  MPU_TYPER;                    /*!< (@ 0x00000000) MPU type register                                          */
  __IM  uint32_t  MPU_CTRL;                     /*!< (@ 0x00000004) MPU control register                                       */
  __IOM uint32_t  MPU_RNR;                      /*!< (@ 0x00000008) MPU region number register                                 */
  __IOM uint32_t  MPU_RBAR;                     /*!< (@ 0x0000000C) MPU region base address register                           */
  __IOM uint32_t  MPU_RASR;                     /*!< (@ 0x00000010) MPU region attribute and size register                     */
} MPU_Type;                                     /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                            STK                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SysTick timer (STK)
  */

typedef struct {                                /*!< (@ 0xE000E010) STK Structure                                              */
  __IOM uint32_t  CSR;                          /*!< (@ 0x00000000) SysTick control and status register                        */
  __IOM uint32_t  RVR;                          /*!< (@ 0x00000004) SysTick reload value register                              */
  __IOM uint32_t  CVR;                          /*!< (@ 0x00000008) SysTick current value register                             */
  __IOM uint32_t  CALIB;                        /*!< (@ 0x0000000C) SysTick calibration value register                         */
} STK_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            SCB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System control block (SCB)
  */

typedef struct {                                /*!< (@ 0xE000ED00) SCB Structure                                              */
  __IM  uint32_t  CPUID;                        /*!< (@ 0x00000000) CPUID base register                                        */
  __IOM uint32_t  ICSR;                         /*!< (@ 0x00000004) Interrupt control and state register                       */
  __IOM uint32_t  VTOR;                         /*!< (@ 0x00000008) Vector table offset register                               */
  __IOM uint32_t  AIRCR;                        /*!< (@ 0x0000000C) Application interrupt and reset control register           */
  __IOM uint32_t  SCR;                          /*!< (@ 0x00000010) System control register                                    */
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000014) Configuration and control register                         */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SHPR2;                        /*!< (@ 0x0000001C) System handler priority registers                          */
  __IOM uint32_t  SHPR3;                        /*!< (@ 0x00000020) System handler priority registers                          */
} SCB_Type;                                     /*!< Size = 36 (0x24)                                                          */


