fduignan/stm32l031_examples/ST7789/STM32L0x3.h
/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define AES_BASE                    0x40026000UL
#define DAC_BASE                    0x40007400UL
#define DMA1_BASE                   0x40020000UL
#define CRC_BASE                    0x40023000UL
#define GPIOA_BASE                  0x50000000UL
#define GPIOB_BASE                  0x50000400UL
#define GPIOC_BASE                  0x50000800UL
#define GPIOD_BASE                  0x50000C00UL
#define GPIOH_BASE                  0x50001C00UL
#define GPIOE_BASE                  0x50001000UL
#define LPTIM_BASE                  0x40007C00UL
#define RNG_BASE                    0x40025000UL
#define RTC_BASE                    0x40002800UL
#define USART1_BASE                 0x40013800UL
#define USART2_BASE                 0x40004400UL
#define USART4_BASE                 0x40004C00UL
#define USART5_BASE                 0x40005000UL
#define TSC_BASE                    0x40024000UL
#define IWDG_BASE                   0x40003000UL
#define WWDG_BASE                   0x40002C00UL
#define USB_FS_BASE                 0x40005C00UL
#define CRS_BASE                    0x40006C00UL
#define Firewall_BASE               0x40011C00UL
#define RCC_BASE                    0x40021000UL
#define SYSCFG_COMP_BASE            0x40010000UL
#define SPI1_BASE                   0x40013000UL
#define SPI2_BASE                   0x40003800UL
#define I2C1_BASE                   0x40005400UL
#define I2C2_BASE                   0x40005800UL
#define I2C3_BASE                   0x40007800UL
#define PWR_BASE                    0x40007000UL
#define Flash_BASE                  0x40022000UL
#define EXTI_BASE                   0x40010400UL
#define ADC_BASE                    0x40012400UL
#define DBGMCU_BASE                 0x40015800UL
#define TIM2_BASE                   0x40000000UL
#define TIM3_BASE                   0x40000400UL
#define TIM6_BASE                   0x40001000UL
#define TIM7_BASE                   0x40001400UL
#define TIM21_BASE                  0x40010800UL
#define TIM22_BASE                  0x40011400UL
#define LPUSART1_BASE               0x40004800UL
#define NVIC_BASE                   0xE000E100UL
#define USB_SRAM_BASE               0x40006000UL
#define LCD_BASE                    0x40002400UL
#define MPU_BASE                    0xE000ED90UL
#define STK_BASE                    0xE000E010UL
#define SCB_BASE                    0xE000ED00UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define AES                         ((AES_Type*)               AES_BASE)
#define DAC                         ((DAC_Type*)               DAC_BASE)
#define DMA1                        ((DMA1_Type*)              DMA1_BASE)
#define CRC                         ((CRC_Type*)               CRC_BASE)
#define GPIOA                       ((GPIOA_Type*)             GPIOA_BASE)
#define GPIOB                       ((GPIOB_Type*)             GPIOB_BASE)
#define GPIOC                       ((GPIOB_Type*)             GPIOC_BASE)
#define GPIOD                       ((GPIOB_Type*)             GPIOD_BASE)
#define GPIOH                       ((GPIOB_Type*)             GPIOH_BASE)
#define GPIOE                       ((GPIOB_Type*)             GPIOE_BASE)
#define LPTIM                       ((LPTIM_Type*)             LPTIM_BASE)
#define RNG                         ((RNG_Type*)               RNG_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define USART1                      ((USART1_Type*)            USART1_BASE)
#define USART2                      ((USART1_Type*)            USART2_BASE)
#define USART4                      ((USART1_Type*)            USART4_BASE)
#define USART5                      ((USART1_Type*)            USART5_BASE)
#define TSC                         ((TSC_Type*)               TSC_BASE)
#define IWDG                        ((IWDG_Type*)              IWDG_BASE)
#define WWDG                        ((WWDG_Type*)              WWDG_BASE)
#define USB_FS                      ((USB_FS_Type*)            USB_FS_BASE)
#define CRS                         ((CRS_Type*)               CRS_BASE)
#define Firewall                    ((Firewall_Type*)          Firewall_BASE)
#define RCC                         ((RCC_Type*)               RCC_BASE)
#define SYSCFG_COMP                 ((SYSCFG_COMP_Type*)       SYSCFG_COMP_BASE)
#define SPI1                        ((SPI1_Type*)              SPI1_BASE)
#define SPI2                        ((SPI1_Type*)              SPI2_BASE)
#define I2C1                        ((I2C1_Type*)              I2C1_BASE)
#define I2C2                        ((I2C1_Type*)              I2C2_BASE)
#define I2C3                        ((I2C1_Type*)              I2C3_BASE)
#define PWR                         ((PWR_Type*)               PWR_BASE)
#define Flash                       ((Flash_Type*)             Flash_BASE)
#define EXTI                        ((EXTI_Type*)              EXTI_BASE)
#define ADC                         ((ADC_Type*)               ADC_BASE)
#define DBGMCU                      ((DBGMCU_Type*)            DBGMCU_BASE)
#define TIM2                        ((TIM2_Type*)              TIM2_BASE)
#define TIM3                        ((TIM2_Type*)              TIM3_BASE)
#define TIM6                        ((TIM6_Type*)              TIM6_BASE)
#define TIM7                        ((TIM6_Type*)              TIM7_BASE)
#define TIM21                       ((TIM21_Type*)             TIM21_BASE)
#define TIM22                       ((TIM22_Type*)             TIM22_BASE)
#define LPUSART1                    ((LPUSART1_Type*)          LPUSART1_BASE)
#define NVIC                        ((NVIC_Type*)              NVIC_BASE)
#define USB_SRAM                    ((USB_SRAM_Type*)          USB_SRAM_BASE)
#define LCD                         ((LCD_Type*)               LCD_BASE)
#define MPU                         ((MPU_Type*)               MPU_BASE)
#define STK                         ((STK_Type*)               STK_BASE)
#define SCB                         ((SCB_Type*)               SCB_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif

#endif /* STM32L0X3_H */


/** @} */ /* End of group STM32L0x3 */

/** @} */ /* End of group  */
